## **SQL BASICS**

### **Import Necessary Libraries**

In [ ]:
import sqlite3

### **Connect to SQLite**

In [ ]:
# Connect to SQLite database (in-memory database for demonstration)
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

### **Create Table**

In [ ]:
# Create a table
cursor.execute('''
CREATE TABLE employee (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    dept TEXT
)
''')

### **Delete Table**

In [ ]:
# cursor.execute('''DROP TABLE employee''')

### **Insert Data**

In [ ]:
# Insert data into the table
cursor.execute('''
INSERT INTO employee (name, age, dept)
VALUES ('Harine', 24, 'Device')
''')
cursor.execute('''
INSERT INTO employee (name, age, dept)
VALUES ('Karkavelraja',19, 'DataScience')
''')
cursor.execute('''
INSERT INTO employee (name, age, dept)
VALUES ('Jagan',24, 'Testing')
''')

In [ ]:
conn.commit()

In [ ]:
# Select data from the table
cursor.execute('SELECT * FROM employee')
rows = cursor.fetchall()

In [ ]:
# Display the data
for row in rows:
    print(row)

(1, 'Harine', 24, 'Device')
(2, 'Karkavelraja', 19, 'DataScience')
(3, 'Jagan', 24, 'Testing')

### **Insert New Data**

In [ ]:
cursor.execute('''
INSERT INTO employee (name, age, dept)
VALUES ('Stuart',5, 'All rounder')
''')

In [ ]:
conn.commit()

In [ ]:
cursor.execute('SELECT * FROM employee')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Harine', 24, 'Device')
(2, 'Karkavelraja', 19, 'DataScience')
(3, 'Jagan', 24, 'Testing')
(4, 'Stuart', 5, 'All rounder')

### **Delete Data**

In [ ]:
cursor.execute('''
DELETE FROM employee WHERE id = 4
''')

In [ ]:
conn.commit()

In [ ]:
cursor.execute('SELECT * FROM employee')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Harine', 24, 'Device')
(2, 'Karkavelraja', 19, 'DataScience')
(3, 'Jagan', 24, 'Testing')

### **Update Data**

In [ ]:
cursor.execute('''
UPDATE employee SET age = 24 WHERE dept = 'DataScience'
''')

In [ ]:
conn.commit()

In [ ]:
cursor.execute('SELECT * FROM employee')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Harine', 24, 'Device')
(2, 'Karkavelraja', 24, 'DataScience')
(3, 'Jagan', 24, 'Testing')

### **Creating One More Table for Join Command**

In [ ]:
cursor.execute('''
CREATE TABLE Education (
    id INTEGER PRIMARY KEY,
    degree TEXT
)
''')

### **Insert Data into the New Table**

In [ ]:
cursor.execute("INSERT INTO Education (degree) VALUES ('Btech')")
cursor.execute("INSERT INTO Education (degree) VALUES ('Mtech')")
cursor.execute("INSERT INTO Education (degree) VALUES ('Btech')")

In [ ]:
conn.commit()

In [ ]:
cursor.execute('SELECT * FROM Education')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Btech')
(2, 'Mtech')
(3, 'Btech')

In [ ]:
cursor.execute('SELECT * FROM employee')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Harine', 24, 'Device')
(2, 'Karkavelraja', 24, 'DataScience')
(3, 'Jagan', 24, 'Testing')

### **Join Two Tables**

In [ ]:
# Joining two tables
cursor.execute('''
SELECT employee.name, Education.degree
FROM employee
JOIN Education ON employee.id = Education.id
''')
rows = cursor.fetchall()
for row in rows:
    print(row)

('Harine', 'Btech')
('Karkavelraja', 'Mtech')
('Jagan', 'Btech')

### **Group by and Aggregate**

In [ ]:
cursor.execute('''
SELECT Education.degree, COUNT(*) as degree_count
FROM employee
JOIN Education ON employee.id = Education.id
GROUP BY Education.degree
''')

rows = cursor.fetchall()

print("\nGrouped Data:")
for row in rows:
    print(row)

Grouped Data:
('Btech', 2)
('Mtech', 1)

### **Order By**

In [ ]:
# Ordering data
cursor.execute('''
SELECT name,dept FROM employee ORDER BY dept DESC
''')
rows = cursor.fetchall()
print("\nOrdered Data:")
for row in rows:
    print(row)

Ordered Data:
('Jagan', 'Testing')
('Harine', 'Device')
('Karkavelraja', 'DataScience')